tangyangguang/Esp32_Faucet/src/web/FaucetWeb.cpp
void sendDateInput(const char* label, const char* name, std::uint32_t seconds) {
    char date[16]{};
    formatDate(seconds >= kMinFilterDateSeconds ? seconds : 0, date, sizeof(date));
    sendFmt("<label class='field'><span>%s</span><input type='date' name='%s' value='%s'></label>",
            label,
            name,
            date);
}

void sendCheckbox(const char* label, const char* name, bool checked) {
    sendFmt("<label class='check-field'><span class='check-title'>%s</span><span class='check-line'><input type='checkbox' name='%s' value='1'%s>启用</span></label>",
            label,
            name,
            checked ? " checked" : "");
}

void handleFaucetPage() {
    if (!sendPageStart("出水龙头")) {
        return;
    }
    if (!requireContext()) {
        sendPageEnd();
        return;
    }
    const AppSnapshot snapshot = g_context.app->snapshot();
    char currentPreset[16]{};
    std::snprintf(currentPreset, sizeof(currentPreset), "%u", static_cast<unsigned>(snapshot.water.selectedPreset + 1));
    char targetValue[24]{};
    if (snapshot.water.mode == WaterMode::Time) {
        std::snprintf(targetValue, sizeof(targetValue), "%lu 秒", static_cast<unsigned long>(snapshot.water.targetValue));
    } else {
        formatLiters(snapshot.water.targetValue, targetValue, sizeof(targetValue));
    }
    char today[24]{};
    char week[24]{};
    char month[24]{};
    char total[24]{};
    formatLiters(snapshot.statistics.todayMl, today, sizeof(today));
    formatLiters(snapshot.statistics.weekMl, week, sizeof(week));
    formatLiters(snapshot.statistics.monthMl, month, sizeof(month));
    formatLiters(snapshot.statistics.totalMl, total, sizeof(total));

    Esp32BaseWeb::sendChunk("<h2>状态</h2><div class='metric-grid'>");
    sendMetricCard("运行状态", stateText(snapshot.water.state));
    sendMetricCard("当前预设", currentPreset);
    sendMetricCard("目标值", targetValue);
    sendMetricCard("今日用水", today);
    Esp32BaseWeb::sendChunk("</div><h2>统计</h2><div class='metric-grid'>");
    sendMetricCard("今日", today);
    sendMetricCard("本周", week);
    sendMetricCard("本月", month);
    sendMetricCard("总累计", total);
    Esp32BaseWeb::sendChunk("</div><h2>滤芯</h2><div class='filter-cards'>");
    bool anyFilter = false;
    for (std::size_t i = 0; i < kFilterCount; ++i) {
        const FilterRecord& filter = g_context.filters->record(i);
        if (!filter.enabled) {
            continue;
        }
        anyFilter = true;
        const std::uint32_t usedDays =
            filter.startTime >= kMinFilterDateSeconds ? g_context.filters->usedDays(i, g_context.nowSeconds()) : 0;
        char life[32]{};
        formatLifeRange(filter, life, sizeof(life));
        char usedFlow[24]{};
        formatLiters(filter.usedMl, usedFlow, sizeof(usedFlow));
        const std::uint32_t progress = filterProgressPercent(filter, usedDays);
        Esp32BaseWeb::sendChunk("<section class='filter-card'><div class='filter-head'><strong>");
        Esp32BaseWeb::writeHtmlEscaped(filter.name);
        sendFmt("</strong><span class='status-pill'>%s</span></div>",
                filterDisplayStatusText(filter, usedDays));
        if (filter.recommendDays > 0) {
            sendFmt("<div class='progress'><span style='width:%lu%%'></span></div>",
                    static_cast<unsigned long>(progress));
            sendFmt("<div class='filter-meta'><span>已用 %lu 天</span><span>寿命 %s</span><span>流量 %s</span><span>进度 %lu%%</span></div></section>",
                    static_cast<unsigned long>(usedDays),
                    life,
                    usedFlow,
                    static_cast<unsigned long>(progress));
        } else {
            Esp32BaseWeb::sendChunk("<p class='hint'>未设置周期</p>");
            sendFmt("<div class='filter-meta'><span>已用 %lu 天</span><span>寿命 %s</span><span>流量 %s</span></div></section>",
                    static_cast<unsigned long>(usedDays),
                    life,
                    usedFlow);
        }
    }
    if (!anyFilter) {
        Esp32BaseWeb::sendChunk("<section class='filter-card muted'>当前没有启用的滤芯。</section>");
    }
    Esp32BaseWeb::sendChunk("</div>");
    sendPageEnd();
}

void handlePresetsPage() {
    if (!sendPageStart("出水预设")) {
        return;
    }
    if (!requireContext()) {
        sendPageEnd();
        return;
    }

    char text[24]{};
    std::uint32_t editIndex = UINT32_MAX;
    if (getParam("index", text, sizeof(text))) {
        parseU32(text, editIndex);
    }
    if (editIndex < kPresetCount) {
        const PresetConfig& preset = g_context.config->presets[editIndex];
        sendFmt("<h2>预设 %u</h2><section class='panel'>"
                "<form method='post' action='/api/faucet/presets' onsubmit='return once(this)'>"
                "<input type='hidden' name='index' value='%u'><input type='hidden' name='return' value='/faucet/presets'>"
                "<div class='grid'>",
                static_cast<unsigned>(editIndex + 1),
                static_cast<unsigned>(editIndex));
        sendCheckbox("启用", "enabled", preset.enabled);
        Esp32BaseWeb::sendChunk("<label class='field'><span>名称</span><input name='name' maxlength='15' value='");
        sendHtmlAttrEscaped(preset.name);
        Esp32BaseWeb::sendChunk("'><small class='hint'>最多 15 个字符</small></label><label class='field'><span>类型</span><select name='type'>");
        sendFmt("<option value='volume'%s>容量</option>", preset.type == PresetType::Volume ? " selected" : "");
        sendFmt("<option value='time'%s>时间</option>", preset.type == PresetType::Time ? " selected" : "");
        Esp32BaseWeb::sendChunk("</select></label>");
        if (preset.type == PresetType::Volume) {
            sendVolumeInput("数值（ml）", "value", preset.value);
        } else {
            sendTextInput("数值（秒）", "value", preset.value);
        }
        Esp32BaseWeb::sendChunk("</div><div class='form-actions'><input type='submit' value='保存'>"
                                "<a href='/faucet/presets'>取消</a></div></form></section>");
        sendPageEnd();
        return;
    }

    Esp32BaseWeb::sendChunk("<h2>预设</h2><table class='compact-table'><tr>"
                            "<th>序号</th><th>名称</th><th>类型</th><th>数值</th><th>状态</th><th>操作</th></tr>");
    for (std::size_t i = 0; i < kPresetCount; ++i) {
        const PresetConfig& preset = g_context.config->presets[i];
        sendFmt("<tr><td>%u</td><td>",
                static_cast<unsigned>(i + 1));
        Esp32BaseWeb::writeHtmlEscaped(preset.name);
        sendFmt("</td><td>%s</td><td>",
                preset.type == PresetType::Time ? "时间" : "容量");
        if (preset.type == PresetType::Time) {
            sendFmt("%lu 秒", static_cast<unsigned long>(preset.value));
        } else {
            sendLiters(preset.value);
        }
        sendFmt("</td><td><span class='status-pill'>%s</span></td>"
                "<td><div class='row-actions'><a href='/faucet/presets?index=%u'>编辑</a></div></td></tr>",
                preset.enabled ? "启用" : "停用",
                static_cast<unsigned>(i));
    }
    Esp32BaseWeb::sendChunk("</table>");
    sendPageEnd();
}

void handleStatsPage() {
    if (!sendPageStart("用水统计")) {
        return;
    }
    if (!requireContext()) {
        sendPageEnd();
        return;
    }
    const StatisticsRecord& stats = g_context.app->snapshot().statistics;
    Esp32BaseWeb::sendChunk("<h2>统计</h2><table>");
    Esp32BaseWeb::sendChunk("<tr><td>今日</td><td>");
    sendLiters(stats.todayMl);
    Esp32BaseWeb::sendChunk("</td></tr><tr><td>本周</td><td>");
    sendLiters(stats.weekMl);
    Esp32BaseWeb::sendChunk("</td></tr><tr><td>本月</td><td>");
    sendLiters(stats.monthMl);
    Esp32BaseWeb::sendChunk("</td></tr><tr><td>总累计</td><td>");
    sendLiters(stats.totalMl);
    Esp32BaseWeb::sendChunk("</td></tr>");
    Esp32BaseWeb::sendChunk("</table>");
    sendPageEnd();
}

void handleLogsPage() {
    if (!sendPageStart("出水记录")) {
        return;
    }
    if (!requireContext()) {
        sendPageEnd();
        return;
    }
    char text[24]{};
    std::uint32_t page = 0;
    if (getParam("page", text, sizeof(text))) {
        parseU32(text, page);
    }
    std::uint32_t requestedPageSize = kDefaultLogPageSize;
    if (getParam("pageSize", text, sizeof(text))) {
        parseU32(text, requestedPageSize);
    }
    const std::uint16_t pageSize = sanitizeLogPageSize(static_cast<std::uint16_t>(requestedPageSize));
    WaterLogRecord records[kMaxLogPageSize]{};
    const bool ready = g_context.logs->ready();
    const std::size_t total = ready ? g_context.logs->count() : 0;
    const std::uint32_t maxPage = total == 0 ? 0 : static_cast<std::uint32_t>((total - 1) / pageSize);
    if (page > maxPage) {
        page = maxPage;
    }
    const std::size_t count = ready ? g_context.logs->readPage(page, pageSize, records, pageSize) : 0;
    Esp32BaseWeb::sendChunk("<h2>记录</h2><form method='get' action='/faucet/logs'><div class='grid'>");
    sendFmt("<label class='field'><span>页码</span><input name='page' value='%lu'></label>",
            static_cast<unsigned long>(page));
    Esp32BaseWeb::sendChunk("<label class='field'><span>每页条数</span><select name='pageSize'>");
    constexpr std::uint16_t sizes[] = {20, 30, 50, 100, 200};
    for (std::uint16_t size : sizes) {
        sendFmt("<option value='%u'%s>%u</option>",
                static_cast<unsigned>(size),
                pageSize == size ? " selected" : "",
                static_cast<unsigned>(size));
    }
    Esp32BaseWeb::sendChunk("</select></label></div><div class='form-actions'><input type='submit' value='查看'>");
    sendFmt("<a href='/faucet/logs?page=0&pageSize=%u'>首页</a>", static_cast<unsigned>(pageSize));
    if (page > 0) {
        sendFmt("<a href='/faucet/logs?page=%lu&pageSize=%u'>上一页</a>",
                static_cast<unsigned long>(page - 1),
                static_cast<unsigned>(pageSize));
    }
    if (page < maxPage) {
        sendFmt("<a href='/faucet/logs?page=%lu&pageSize=%u'>下一页</a>",
                static_cast<unsigned long>(page + 1),
                static_cast<unsigned>(pageSize));
    }
    sendFmt("</div><small class='hint'>第 %lu / %lu 页，共 %lu 条</small></form>"
            "<table><tr><th>时间</th><th>出水量</th><th>时长</th><th>模式</th><th>结果</th></tr>",
            static_cast<unsigned long>(page + 1),
            static_cast<unsigned long>(maxPage + 1),
            static_cast<unsigned long>(total));
    for (std::size_t i = 0; i < count; ++i) {
        sendFmt("<tr><td>%lu</td><td>", static_cast<unsigned long>(records[i].startTime));
        sendLiters(records[i].volumeMl);
        sendFmt("</td><td>%u s</td><td>%s</td><td>%s</td></tr>",
                static_cast<unsigned>(records[i].durationSec),
                modeText(records[i].mode),
                resultText(records[i].result));
    }
    Esp32BaseWeb::sendChunk("</table>");
    if (!ready) {
        Esp32BaseWeb::sendChunk("<p>记录存储不可用。</p>");
    }
    sendPageEnd();
}

